src/config/Reports/ПланВыполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>ПланВыполненияЗадач</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКрупныйШрифт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЦветЗадач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВыходныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьЗадачиОперативногоПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/InformationRegisters/ПланВыполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПланВыполненияЗадач</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/ОперативныйПланЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОперативныйПланЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Documents/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Задача</Name>
			<BasedOn>
				<xr:Item>Document.Задача</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МодулиСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляРелиза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПорядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХЗ_ОписаниеДляРелиза</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХЗ_Подробности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительОтклик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизыКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВОписаниеПоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовностиТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗадачиВнешний</Name>
					<Comment>Номер задачи в какой-либо иной базе или баг-трекере</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СутьРешенияЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуютсяАвтотесты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКОбработкеАвтотеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТребованийКАвтотесту</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавлен</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХЗ</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтслеживающиеПользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Reports/ПланВыполненияЗадач/Ext/ObjectModule.bsl
Процедура ОбрезатьТЗПланВыполненияЗадачПоДатам(ТЗПланВыполненияЗадач)
	
	мДатаНачала = НачалоДня(ДатаНачала);
	мДатаОкончания = КонецДня(ДатаОкончания);
	
	Для Каждого ТекСтрока Из ТЗПланВыполненияЗадач Цикл
		Если ТекСтрока.ДатаНачалаПлан < мДатаНачала Тогда 
			ТекСтрока.ДатаНачалаПлан = мДатаНачала;
			ТекСтрока.ОбрезанаДатаНачала = Истина;
		КонецЕсли;
		Если ТекСтрока.ДатаОкончанияПлан > мДатаОкончания Тогда 
			ТекСтрока.ДатаОкончанияПлан = мДатаОкончания;
			ТекСтрока.ОбрезанаДатаОкончания = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИмяОбластиДня(Префикс, ИсполнительКод, ТекДата)
	
	ИмяОбластиДня = Префикс + "_" + ИсполнительКод + "_" + Формат(ТекДата, "ДФ=yyyyMMdd");
	
	Возврат ИмяОбластиДня;

КонецФункции

Функция ПолучитьЗаголовокЗадачи(НомерЗадачи, Суть)
	
	Возврат СокрЛП("(№ "+Общий.офУдалитьЛидирующиеСимволы(НомерЗадачи)+") " + Суть);	
	
КонецФункции

Функция ПолучитьНовуюСтруктуруРасшифровки(ИмяСтруктуры, Период = Неопределено, Задача = Неопределено, Исполнитель = Неопределено) Экспорт 
	
	Возврат Новый Структура("ИмяСтруктуры, Период, Задача, Исполнитель", ИмяСтруктуры, Период, Задача, Исполнитель);
		
КонецФункции


Процедура ЗаполнитьОбластьОбъединения(ИмяСтруктуры, СтруктураЗадачи, ОбластьОбъединения, ЛинияГраницыВерхНиз, ЛинияГраницыЛевая, ЛинияГраницыПравая, ЦветФона, УзорЗаливки)
	
	ОбластьОбъединения.ЦветРамки = WebЦвета.Черный;
	ОбластьОбъединения.Обвести(ЛинияГраницыЛевая, ЛинияГраницыВерхНиз, ЛинияГраницыПравая, ЛинияГраницыВерхНиз);
	ОбластьОбъединения.Объединить();
	
	ОбластьОбъединения.ЦветФона = ЦветФона;
	ОбластьОбъединения.Узор = УзорЗаливки;
	//ОбластьОбъединения.ЦветУзора = WebЦвета.ТемноСерый;
	
	Если ТипЗнч(СтруктураЗадачи.Задача) = Тип("ДокументСсылка.Задача") Тогда
		ОбластьОбъединения.Текст = ПолучитьЗаголовокЗадачи(СтруктураЗадачи.НомерЗадачи, СтруктураЗадачи.Суть);
		ОбластьОбъединения.Примечание.Текст = СтруктураЗадачи.Задача.Подробности;
	Иначе
		ОбластьОбъединения.Текст = СокрЛП("" + СтруктураЗадачи.Задача);
	КонецЕсли;
	ОбластьОбъединения.Расшифровка = ПолучитьНовуюСтруктуруРасшифровки(ИмяСтруктуры, СтруктураЗадачи.Период, СтруктураЗадачи.Задача, СтруктураЗадачи.Исполнитель);
	
КонецПроцедуры

Процедура ЗаполнитьПустуюОбласть(ИмяСтруктуры, СтруктураЗадачи, ОбластьОбъединения)
	
	//ОбластьОбъединения.ЦветРамки = WebЦвета.Черный;
	//ОбластьОбъединения.Обвести(ЛинияГраницыЛевая, ЛинияГраницыВерхНиз, ЛинияГраницыПравая, ЛинияГраницыВерхНиз);
	//ОбластьОбъединения.Объединить();
	//
	//ОбластьОбъединения.ЦветФона = ЦветФона;
	//ОбластьОбъединения.Узор = УзорЗаливки;
	////ОбластьОбъединения.ЦветУзора = WebЦвета.ТемноСерый;
	//
	//Если ТипЗнч(СтруктураЗадачи.Задача) = Тип("ДокументСсылка.Задача") Тогда
	//	ОбластьОбъединения.Текст = ПолучитьЗаголовокЗадачи(СтруктураЗадачи.НомерЗадачи, СтруктураЗадачи.Суть);
	//	ОбластьОбъединения.Примечание.Текст = СтруктураЗадачи.Задача.Подробности;
	//Иначе
	//	ОбластьОбъединения.Текст = СокрЛП("" + СтруктураЗадачи.Задача);
	//КонецЕсли;
	ОбластьОбъединения.Расшифровка = ПолучитьНовуюСтруктуруРасшифровки(ИмяСтруктуры, СтруктураЗадачи.Период, , СтруктураЗадачи.Исполнитель);
	
КонецПроцедуры

Процедура СформироватьОтчет(ИсхОбъект, ТабДок) Экспорт
	
	Если Ложь Тогда
		ТабДок = Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если ИспользоватьКрупныйШрифт Тогда
		Макет = ПолучитьМакет("МакетПланаВыполненияКрупныйШрифт");
	Иначе
		Макет = ПолучитьМакет("МакетПланаВыполнения");
	КонецЕсли;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьИсполнителиШапка = Макет.ПолучитьОбласть("ОбластьШапка|ОбластьИсполнительКолонка");
	ОбластьПериодШапка = Макет.ПолучитьОбласть("ОбластьШапка|ОбластьДеньКолонка");
	ОбластьИсполнитель = Макет.ПолучитьОбласть("ОбластьДанные|ОбластьИсполнительКолонка");
	ОбластьИсполнительДень = Макет.ПолучитьОбласть("ОбластьДанные|ОбластьДеньКолонка");
	ОбластьЛегенда = Макет.ПолучитьОбласть("ОбластьЛегенда");
	
	// Для данных "Оперативного плана задач"
	ОбластьИсполнительДеньОПЗ = Макет.ПолучитьОбласть("ОбластьДанныеПотокА|ОбластьДеньКолонкаОперативногоПлана");
	ОбластьИсполнительДеньПустаяОПЗ = Макет.ПолучитьОбласть("ОбластьДанныеПотокА|ОбластьПустаяКолонкаОперативногоПлана");
	ОбластьРазделитель = Макет.ПолучитьОбласть("ОбластьРазделитель");
	
	ЛинияСплошная = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ЛинияСплошнаяПолужирная = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 3, Истина);
	ЛинияРедкийПунктир = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.РедкийПунктир, 1);
	
	ТабДок.Очистить();

	ТабДок.Вывести(ОбластьЗаголовок); 
	ТабДок.Вывести(ОбластьИсполнителиШапка);

	ТекДата = ДатаНачала;
	Объединения = Новый Массив;
	КолонкиВыходныхДней = Новый Массив;
	
	ЦветФонаБудни = WebЦвета.Белый;
	ЦветФонаВыходной = WebЦвета.Золотой;//ЦветаСтиля.ЦветРамки;
	
	НачПоз = 3;
	К = НачПоз;
	НомерКолонкиТекущаяДата = 0;
	ТекущийДень = НачалоДня(ТекущаяДата());
	
	// 1. Вывод шапки отчета: месяцы и даты
	
	Пока ТекДата <= ДатаОкончания Цикл
		
		ОбластьПериодШапка.Параметры.мЧисло = День(ТекДата);
		ОбластьПериодШапка.Параметры.мМесяц = формат(ТекДата, "ДФ=MMMM") + ", " + формат(ТекДата, "ДФ=yyyy");
		
		СледДата = ТекДата + 86400;
		Если Месяц(СледДата) <> Месяц(ТекДата) ИЛИ ТекДата = ДатаОкончания Тогда 
			Объединения.Добавить(К);
		КонецЕсли;

		ЭтоВыходнойДень = Общий.офЭтоВыходнойДень(ТекДата);
		
		Если ЭтоВыходнойДень Тогда 
			ОбластьПериодШапка.Область("R2C1").ЦветФона = ЦветФонаВыходной;
			КолонкиВыходныхДней.Добавить(К);
		Иначе
			ОбластьПериодШапка.Область("R2C1").ЦветФона = ЦветФонаБудни;
		КонецЕсли;
		
		Если ТекущийДень = ТекДата Тогда
			НомерКолонкиТекущаяДата = К;
		КонецЕсли;
		ТабДок.Присоединить(ОбластьПериодШапка);
		К = К + 1;
		ТекДата = СледДата;
	КонецЦикла;
	
	// 2. Объединение месяцев
	
	НачалоОбъединения = НачПоз;
	Для Каждого КонецОбъединения Из Объединения Цикл
		ТабДок.Область("R3C"+НачалоОбъединения+":R3C"+КонецОбъединения).Объединить();
		НачалоОбъединения = КонецОбъединения + 1;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьРазделитель); 
	
	// 3.1 Получение исполнителей
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ОтображатьВПланеВыполненияЗадач = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование";
	
	Исполнители = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	// 3.2 Получение ТЗ План выполнения задач
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланВыполненияЗадач.Период,
	|	ПланВыполненияЗадач.Задача,
	|	ВЫБОР
	|		КОГДА ПланВыполненияЗадач.Задача ССЫЛКА Документ.Задача
	|			ТОГДА ПланВыполненияЗадач.Задача.Суть
	|		ИНАЧЕ ПланВыполненияЗадач.Задача
	|	КОНЕЦ КАК Суть,
	|	ПланВыполненияЗадач.Задача.Номер КАК НомерЗадачи,
	|	ПланВыполненияЗадач.ДатаНачалаПлан,
	|	ПланВыполненияЗадач.ДатаОкончанияПлан,
	|	ПланВыполненияЗадач.Исполнитель КАК Исполнитель,
	|	ПланВыполненияЗадач.Задача.СостояниеЗадачи КАК СостояниеЗадачи,
	|	ПланВыполненияЗадач.Задача.ИсполнительОтклик КАК ИсполнительОтклик
	|ИЗ
	|	РегистрСведений.ПланВыполненияЗадач КАК ПланВыполненияЗадач
	|ГДЕ
	|	(ПланВыполненияЗадач.ДатаНачалаПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			ИЛИ ПланВыполненияЗадач.ДатаОкончанияПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			ИЛИ &ДатаНачала МЕЖДУ ПланВыполненияЗадач.ДатаНачалаПлан И ПланВыполненияЗадач.ДатаОкончанияПлан
	|				И (&ДатаОкончания МЕЖДУ ПланВыполненияЗадач.ДатаНачалаПлан И ПланВыполненияЗадач.ДатаОкончанияПлан))
	|	И ПланВыполненияЗадач.Исполнитель В(&Исполнители)";
	
	Запрос.УстановитьПараметр("Исполнители", Исполнители);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	ТЗПланВыполненияЗадач = Запрос.Выполнить().Выгрузить();
	
	ТЗПланВыполненияЗадач.Колонки.Добавить("ОбрезанаДатаНачала");
	ТЗПланВыполненияЗадач.Колонки.Добавить("ОбрезанаДатаОкончания");
	
	ОбрезатьТЗПланВыполненияЗадачПоДатам(ТЗПланВыполненияЗадач);
	//РаспледелитьТЗПланВыполненияЗадачПоПотокам(ТЗПланВыполненияЗадач);
	
	Если ОтображатьЗадачиОперативногоПлана Тогда 
		//3.3 Получение данных оперативного плана задач
		
		ЗапросОперативныйПланЗадач = Новый Запрос;
		
		ЗапросОперативныйПланЗадач.Текст = 
		"ВЫБРАТЬ
		|	ОперативныйПланЗадач.Задача КАК Задача,
		|	ОперативныйПланЗадач.Порядок КАК Порядок,
		|	ОперативныйПланЗадач.Задача.Суть КАК Суть,
		|	ОперативныйПланЗадач.Задача.Исполнитель КАК Исполнитель,
		|	ОперативныйПланЗадач.Задача.СостояниеЗадачи КАК СостояниеЗадачи,
		|	ОперативныйПланЗадач.Задача.ИсполнительОтклик КАК ЗадачаИсполнительОтклик,
		|	НЕОПРЕДЕЛЕНО КАК Период
		|ПОМЕСТИТЬ ВТОперативныйПланЗадач
		|ИЗ
		|	РегистрСведений.ОперативныйПланЗадач КАК ОперативныйПланЗадач
		|ГДЕ
		|	ОперативныйПланЗадач.Задача.СостояниеЗадачи <> ЗНАЧЕНИЕ(Справочник.СостоянияЗадач.Закрыта)
		|	И НЕ ОперативныйПланЗадач.Задача В (&ЗадачиОперативногоПлана)
		|	И ОперативныйПланЗадач.Задача.Исполнитель В(&СписокПользователей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОперативныйПланЗадач.Задача,
		|	ВТОперативныйПланЗадач.Порядок,
		|	ВТОперативныйПланЗадач.Суть,
		|	ВТОперативныйПланЗадач.Задача.Номер КАК НомерЗадачи,
		|	ВТОперативныйПланЗадач.Исполнитель КАК Исполнитель,
		|	ВТОперативныйПланЗадач.СостояниеЗадачи,
		|	ВТОперативныйПланЗадач.ЗадачаИсполнительОтклик КАК ИсполнительОтклик,
		|	ВТОперативныйПланЗадач.Период
		|ИЗ
		|	ВТОперативныйПланЗадач КАК ВТОперативныйПланЗадач
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТОперативныйПланЗадач.Порядок
		|ИТОГИ ПО
		|	Исполнитель
		|АВТОУПОРЯДОЧИВАНИЕ";

		ЗапросОперативныйПланЗадач.УстановитьПараметр("ЗадачиОперативногоПлана", ТЗПланВыполненияЗадач.ВыгрузитьКолонку("Задача"));
		ЗапросОперативныйПланЗадач.УстановитьПараметр("СписокПользователей", Исполнители);
		ВыборкаОперативныйПланЗадач = ЗапросОперативныйПланЗадач.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	// 4. Вывод данных: 
	//		- Вывод всего периода по дням
	//		- Вывод данных "Плана выполнения задач"
	//		- Вывод данных "Оперативного плана задач"
	//		- 
	//		- 
	
	КолРазделителей = 1;
	Для Каждого ТекСтрокаИсполнитель Из Исполнители Цикл
		
		// Вывод всего периода по дням для тек. исполнителя
		
		ОбластьИсполнитель.Параметры.Исполнитель = ТекСтрокаИсполнитель;
		ТабДок.Вывести(ОбластьИсполнитель); 
		
		ТекДата = ДатаНачала;
		ИсполнительКод = СокрЛП(ТекСтрокаИсполнитель.Код);
		Пока ТекДата <= ДатаОкончания Цикл
			
			ОбластьИсполнительДень.Область("R1C1").Имя = ПолучитьИмяОбластиДня("ПотокА", ИсполнительКод, ТекДата);
			ЗаполнитьПустуюОбласть("ПустаяОбласть", Новый Структура("Период, Исполнитель", ТекДата, ТекСтрокаИсполнитель), ОбластьИсполнительДень.Область("R1C1"));
			
			ОбластьИсполнительДень.Область("R2C1").Имя = ПолучитьИмяОбластиДня("ПотокБ", ИсполнительКод, ТекДата);
			ЗаполнитьПустуюОбласть("ПустаяОбласть", Новый Структура("Период, Исполнитель", ТекДата, ТекСтрокаИсполнитель), ОбластьИсполнительДень.Область("R2C1"));
			
			
			ТабДок.Присоединить(ОбластьИсполнительДень);
			ТекДата = ТекДата + 86400;
		КонецЦикла;
		
		// Вывод данных "Плана выполнения задач"
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Исполнитель", ТекСтрокаИсполнитель);
		
		НайденныеСтроки = ТЗПланВыполненияЗадач.Скопировать(ОтборСтрок);
		НайденныеСтроки.Сортировать("ДатаНачалаПлан");
		
		//Общий.офВыполнитьКод("П1.Сортировать(""ДатаНачалаПлан"");", НайденныеСтроки);
		
		ИсполнительКод = СокрЛП(ТекСтрокаИсполнитель.Код);
		Для Каждого ТекПланЗадачи Из НайденныеСтроки Цикл
			
			ПереставитьВПотокБ = Ложь;
			Попытка
				ОбластьНачало = ТабДок.Область(ПолучитьИмяОбластиДня("ПотокА", ИсполнительКод, ТекПланЗадачи.ДатаНачалаПлан));
				мВерх = ОбластьНачало.Верх;
				мЛево = ОбластьНачало.Лево;
				
				Если ОбластьНачало.Расшифровка <> Неопределено И ОбластьНачало.Расшифровка.ИмяСтруктуры <> "ПустаяОбласть" Тогда 
					ПереставитьВПотокБ = Истина;
				КонецЕсли; 
				
				ОбластьОкончание = ТабДок.Область(ПолучитьИмяОбластиДня("ПотокА", ИсполнительКод, ТекПланЗадачи.ДатаОкончанияПлан));
				мНиз = ОбластьОкончание.Низ;
				мПраво = ОбластьОкончание.Право;
			Исключение
				ПереставитьВПотокБ = Истина;
			КонецПопытки;
			
			Если ПереставитьВПотокБ Тогда 
				Попытка
					ОбластьНачало = ТабДок.Область(ПолучитьИмяОбластиДня("ПотокБ", ИсполнительКод, ТекПланЗадачи.ДатаНачалаПлан));
					мВерх = ОбластьНачало.Верх;
					мЛево = ОбластьНачало.Лево;
					
					Если ОбластьНачало.Расшифровка <> Неопределено  И ОбластьНачало.Расшифровка.ИмяСтруктуры <> "ПустаяОбласть" Тогда 
						ВызватьИсключение "";
					КонецЕсли; 
					
					ОбластьОкончание = ТабДок.Область(ПолучитьИмяОбластиДня("ПотокБ", ИсполнительКод, ТекПланЗадачи.ДатаОкончанияПлан));
					мНиз = ОбластьОкончание.Низ;
					мПраво = ОбластьОкончание.Право;
				Исключение
					Сообщить("Не удалось разместить задачу: " + ТекПланЗадачи.Задача);
					Продолжить;
				КонецПопытки;
			КонецЕсли;
			
			ОбластьОбъединения = ТабДок.Область("R"+мВерх+"C"+мЛево+":R"+мНиз+"C"+мПраво);
	
			Если СкрыватьЦветЗадач Тогда 
				ЦветФона = WebЦвета.Белый;
				УзорЗаливки = Общий.обПолучитьУзорЗаливкиСостоянияЗадачи(ТекПланЗадачи.СостояниеЗадачи, ТекПланЗадачи.Исполнитель, ТекПланЗадачи.ИсполнительОтклик);
			Иначе 
				ЦветФона = Общий.обПолучитьЦветСостоянияЗадачи(ТекПланЗадачи.СостояниеЗадачи, ТекПланЗадачи.Исполнитель, ТекПланЗадачи.ИсполнительОтклик);
				УзорЗаливки = ТипУзораТабличногоДокумента.БезУзора;
			КонецЕсли;
			ЛинияГраницыЛевая = ?(ТекПланЗадачи.ОбрезанаДатаНачала = Истина, ЛинияРедкийПунктир, ЛинияСплошная);
			ЛинияГраницыПравая = ?(ТекПланЗадачи.ОбрезанаДатаОкончания = Истина, ЛинияРедкийПунктир, ЛинияСплошная);
			
			ЗаполнитьОбластьОбъединения("ЗадачаПланаВыполнения", ТекПланЗадачи, ОбластьОбъединения, ЛинияСплошная, ЛинияГраницыЛевая, ЛинияГраницыПравая, ЦветФона, УзорЗаливки);
			
			НоваяСтрока = НаборРасшифровок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбластьОбъединения.Расшифровка);
			
			НоваяСтрока.RowT = мВерх;
			НоваяСтрока.ColL = мЛево;
			НоваяСтрока.RowB = мНиз;
			НоваяСтрока.ColR = мПраво;
			
		КонецЦикла;
		
		Если ОтображатьЗадачиОперативногоПлана Тогда 
			// Вывод данных "Оперативного плана задач"
			СтуктураПоиска = Новый Структура("Исполнитель", ТекСтрокаИсполнитель);
			
			ВыборкаОперативныйПланЗадач.Сбросить();
			Пока ВыборкаОперативныйПланЗадач.НайтиСледующий(СтуктураПоиска) Цикл 
				ВыборкаОперативныйПланЗадачЗадачи = ВыборкаОперативныйПланЗадач.Выбрать();
				ТабДок.Присоединить(ОбластьИсполнительДеньПустаяОПЗ);
				Пока ВыборкаОперативныйПланЗадачЗадачи.Следующий() Цикл 
					
					ОбластьОбъединения = ОбластьИсполнительДеньОПЗ.Область("R1C1");
					
					Если СкрыватьЦветЗадач Тогда 
						ЦветФона = WebЦвета.Белый;
						УзорЗаливки = Общий.обПолучитьУзорЗаливкиСостоянияЗадачи(ТекПланЗадачи.СостояниеЗадачи, ТекПланЗадачи.Исполнитель, ТекПланЗадачи.ИсполнительОтклик);
					Иначе 
						ЦветФона = Общий.обПолучитьЦветСостоянияЗадачи(ВыборкаОперативныйПланЗадачЗадачи.СостояниеЗадачи, ВыборкаОперативныйПланЗадачЗадачи.Исполнитель, ВыборкаОперативныйПланЗадачЗадачи.ИсполнительОтклик);
						УзорЗаливки = ТипУзораТабличногоДокумента.БезУзора;
					КонецЕсли;
					
					ЗаполнитьОбластьОбъединения("ЗадачаОперативногоПлана", ВыборкаОперативныйПланЗадачЗадачи, ОбластьОбъединения, ЛинияСплошная, ЛинияСплошная, ЛинияСплошная, ЦветФона, УзорЗаливки);
					
					ТабДок.Присоединить(ОбластьИсполнительДеньОПЗ);
					ТабДок.Присоединить(ОбластьИсполнительДеньПустаяОПЗ);
					
				КонецЦикла;
			КонецЦикла;
        КонецЕсли;
		ТабДок.Вывести(ОбластьРазделитель); 
		КолРазделителей = КолРазделителей + 1;
	КонецЦикла;	
	
	// отобразим текущую дату
	
	Если НомерКолонкиТекущаяДата <> 0 Тогда
		мВерх = НачПоз+1;
		мВерх = НачПоз + 2;
		Для К = 1 По КолРазделителей-1 Цикл
			ТабДок.Область("R"+мВерх+"C"+НомерКолонкиТекущаяДата).ЦветФона = WebЦвета.ТемноБордовый;
			мВерх = мВерх + 3;
		КонецЦикла;
	КонецЕсли;
	
	Если СкрыватьВыходныеДни Тогда 
		Для Каждого НомерКолонки Из КолонкиВыходныхДней Цикл
			ТабДок.Область("R4C"+НомерКолонки+":R4C"+НомерКолонки).Очистить(Истина, Ложь, Ложь);
			ТабДок.Область("R4C"+(НомерКолонки+1)+":R4C"+(НомерКолонки+1)).ГраницаСлева = ЛинияСплошнаяПолужирная;
			ТабДок.Область("R4C"+НомерКолонки+":R4C"+НомерКолонки).ШиринаКолонки = 0;
		КонецЦикла;
	КонецЕсли; 
	
	// Выведем легенду
	
	Если СкрыватьЦветЗадач Тогда 
		//ОбластьЛегенда.Область("ОбластьЗаливка").ЦветУзора = WebЦвета.ТемноСерый;
		
		ОбластьЛегенда.Область("ОбластьЗаливка").Узор = Общий.обПолучитьУзорЗаливкиСостоянияЗадачи(Справочники.СостоянияЗадач.Назначена, Неопределено, Неопределено);
		ОбластьЛегенда.Параметры.СостояниеЗадачи = " - Назначена (Не выполнена)";
		//ТабДок.Вывести(ОбластьЛегенда);
		
		ОбластьЛегенда.Область("ОбластьЗаливка1").Узор = Общий.обПолучитьУзорЗаливкиСостоянияЗадачи(Справочники.СостоянияЗадач.Отработана, Неопределено, Неопределено);
		ОбластьЛегенда.Параметры.СостояниеЗадачи1 = " - Выполнена, ведется тестирование";
		ТабДок.Вывести(ОбластьЛегенда);
		
		ОбластьЛегенда.Область("ОбластьЗаливка").Узор = Общий.обПолучитьУзорЗаливкиСостоянияЗадачи(Справочники.СостоянияЗадач.ВРаботе, Неопределено, Неопределено);
		ОбластьЛегенда.Параметры.СостояниеЗадачи = " - В работе";
		//ТабДок.Вывести(ОбластьЛегенда);
		
		ОбластьЛегенда.Область("ОбластьЗаливка1").Узор = Общий.обПолучитьУзорЗаливкиСостоянияЗадачи(Справочники.СостоянияЗадач.Закрыта, Неопределено, Неопределено);
		ОбластьЛегенда.Параметры.СостояниеЗадачи1 = " - Выполнена";
		ТабДок.Вывести(ОбластьЛегенда);
		
		ОбластьЛегенда.Область("ОбластьЗаливка").Узор = Общий.обПолучитьУзорЗаливкиСостоянияЗадачи(Справочники.СостоянияЗадач.НуженОтклик, Неопределено, Неопределено);
		ОбластьЛегенда.Параметры.СостояниеЗадачи = " - На согласовании";
		//ТабДок.Вывести(ОбластьЛегенда);
		
		ЛинияГраницыНетЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 1);
		ОбластьЛегенда.Область("ОбластьЗаливка1").Узор = ТипУзораТабличногоДокумента.БезУзора;
		ОбластьЛегенда.Область("ОбластьЗаливка1").Обвести(ЛинияГраницыНетЛинии, ЛинияГраницыНетЛинии, ЛинияГраницыНетЛинии, ЛинияГраницыНетЛинии);
		ОбластьЛегенда.Параметры.СостояниеЗадачи1 = "";
		ТабДок.Вывести(ОбластьЛегенда);
	КонецЕсли;

	// прочие настройки
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСлева = 3;
	ТабДок.ПолеСправа = 3;
	ТабДок.ВерхнийКолонтитул.ТекстСлева = "Сформирован: " + Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy    HH:mm'");
	ТабДок.ВерхнийКолонтитул.Выводить = Истина;

	СохранитьПеременныеВОбъект(исхОбъект);
	
КонецПроцедуры

Процедура СохранитьПеременныеВОбъект(исхОбъект)
	
	исхОбъект.НаборРасшифровок.Загрузить(НаборРасшифровок.Выгрузить());

КонецПроцедуры
